app/controllers/page_controller.rb

SELECT * FROM "blog_posts"
---
  def index
    @blog_posts = BlogPost.find :all