app/controllers/sandbox_controller.rb

INSERT INTO "sandbox_users" ("name", "receive_emails", "updated_at", "identifier_hash", "username", "password_hash", "email", "created_at") VALUES('Jay Phillips', NULL, '2009-01-05 22:31:18', '73557cc4a3a83b95d2301461a5adba2f', 'jicksta', 'f067ed212ec4b1b891852471192b6d35', 'Jicksta@Gmail.com', '2009-01-05 22:31:18')
---
  def register_user
    if params["confirm_password"] != params["sandbox_user"]["password"]
      render :text => '{password: ["differs from confirmation"]}', :status => 500, :content_type => "text/x-json"
      return
    end
    user = SandboxUser.new params["sandbox_user"]
    if user.save